Revit 2024 API
TextBoxEnterPressedEventArgs Members
The TextBoxEnterPressedEventArgs type exposes the following members.
Constructors
Name | Description
TextBoxEnterPressedEventArgs
Initializes a new instance of the TextBoxEnterPressedEventArgs class
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Application
 The current UIApplication.
 (Inherited from RibbonItemEventArgs.)
See Also
TextBoxEnterPressedEventArgs Class
Autodesk.Revit.UI.Events Namespace